Masmiseim36/nxpSDK/devices/MK65F18/cmsis_drivers/fsl_i2c_cmsis.c
    return stat;
}
#endif

#if defined(I2C0)
extern uint32_t I2C0_GetFreq(void);
extern void I2C0_InitPins(void);
extern void I2C0_DeinitPins(void);

cmsis_i2c_resource_t I2C0_Resource = {I2C0, I2C0_GetFreq};

cmsis_i2c_handle_t I2C0_handle;

#if defined(__CC_ARM)
ARMCC_SECTION("i2c0_interrupt_driver_state")
cmsis_i2c_interrupt_driver_state_t I2C0_InterruptDriverState = {
#else
cmsis_i2c_interrupt_driver_state_t I2C0_InterruptDriverState = {
#endif
    &I2C0_Resource, &I2C0_handle,

};

static int32_t I2C0_InterruptInitialize(ARM_I2C_SignalEvent_t cb_event)
{
    I2C0_InitPins();
    return I2C_InterruptInitialize(cb_event, &I2C0_InterruptDriverState);
}
static int32_t I2C0_InterruptUninitialize(void)
{
    I2C0_DeinitPins();
    return I2C_InterruptUninitialize(&I2C0_InterruptDriverState);
}
static int32_t I2C0_InterruptPowerControl(ARM_POWER_STATE state)
{
    return I2C_InterruptPowerControl(state, &I2C0_InterruptDriverState);
}
int32_t I2C0_Master_InterruptTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_InterruptTransmit(addr, data, num, xfer_pending, &I2C0_InterruptDriverState);
}

int32_t I2C0_Master_InterruptReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_InterruptReceive(addr, data, num, xfer_pending, &I2C0_InterruptDriverState);
}

int32_t I2C0_Slave_InterruptTransmit(const uint8_t *data, uint32_t num)
{
    return I2C_Slave_InterruptTransmit(data, num, &I2C0_InterruptDriverState);
}
int32_t I2C0_Slave_InterruptReceive(uint8_t *data, uint32_t num)
{
    return I2C_Slave_InterruptReceive(data, num, &I2C0_InterruptDriverState);
}
int32_t I2C0_InterruptGetDataCount(void)
{
    return I2C_InterruptGetDataCount(&I2C0_InterruptDriverState);
}
int32_t I2C0_InterruptControl(uint32_t control, uint32_t arg)
{
    return I2C_InterruptControl(control, arg, &I2C0_InterruptDriverState);
}
ARM_I2C_STATUS I2C0_InterruptGetStatus(void)
{
    return I2C_InterruptGetStatus(&I2C0_InterruptDriverState);
}

ARM_DRIVER_I2C I2C0_Interrupt_Driver = {I2Cx_GetVersion,
                                        I2Cx_GetCapabilities,
                                        I2C0_InterruptInitialize,
                                        I2C0_InterruptUninitialize,
                                        I2C0_InterruptPowerControl,
                                        I2C0_Master_InterruptTransmit,
                                        I2C0_Master_InterruptReceive,
                                        I2C0_Slave_InterruptTransmit,
                                        I2C0_Slave_InterruptReceive,
                                        I2C0_InterruptGetDataCount,
                                        I2C0_InterruptControl,
                                        I2C0_InterruptGetStatus};

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

cmsis_i2c_dma_resource_t I2C0_DmaResource = {RTE_I2C0_Master_DMA_BASE, RTE_I2C0_Master_DMA_CH,
                                             RTE_I2C0_Master_DMAMUX_BASE, RTE_I2C0_Master_PERI_SEL};

i2c_master_dma_handle_t I2C0_DmaHandle;
dma_handle_t I2C0_DmaTxRxHandle;

#if defined(__CC_ARM)
ARMCC_SECTION("i2c0_dma_driver_state")
cmsis_i2c_dma_driver_state_t I2C0_DmaDriverState = {
#else
cmsis_i2c_dma_driver_state_t I2C0_DmaDriverState = {
#endif
    &I2C0_Resource, &I2C0_DmaResource, &I2C0_DmaHandle, &I2C0_DmaTxRxHandle,
};

static int32_t I2C0_Master_DmaInitialize(ARM_I2C_SignalEvent_t cb_event)
{
    I2C0_InitPins();
    return I2C_Master_DmaInitialize(cb_event, &I2C0_DmaDriverState);
}
int32_t I2C0_Master_DmaUninitialize(void)
{
    I2C0_DeinitPins();
    return I2C_Master_DmaUninitialize(&I2C0_DmaDriverState);
}
int32_t I2C0_Master_DmaPowerControl(ARM_POWER_STATE state)
{
    return I2C_Master_DmaPowerControl(state, &I2C0_DmaDriverState);
}
int32_t I2C0_Master_DmaTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_DmaTransmit(addr, data, num, xfer_pending, &I2C0_DmaDriverState);
}
int32_t I2C0_Master_DmaReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_DmaReceive(addr, data, num, xfer_pending, &I2C0_DmaDriverState);
}
int32_t I2C0_Master_DmaGetDataCount(void)
{
    return I2C_Master_DmaGetDataCount(&I2C0_DmaDriverState);
}
int32_t I2C0_Master_DmaControl(uint32_t control, uint32_t arg)
{
    return I2C_Master_DmaControl(control, arg, &I2C0_DmaDriverState);
}
ARM_I2C_STATUS I2C0_Master_DmaGetStatus(void)
{
    return I2C_Master_DmaGetStatus(&I2C0_DmaDriverState);
}

ARM_DRIVER_I2C I2C0_Master_Dma_Driver = {I2Cx_GetVersion,
                                         I2Cx_GetCapabilities,
                                         I2C0_Master_DmaInitialize,
                                         I2C0_Master_DmaUninitialize,
                                         I2C0_Master_DmaPowerControl,
                                         I2C0_Master_DmaTransmit,
                                         I2C0_Master_DmaReceive,
                                         NULL,
                                         NULL,
                                         I2C0_Master_DmaGetDataCount,
                                         I2C0_Master_DmaControl,
                                         I2C0_Master_DmaGetStatus};
#endif

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

cmsis_i2c_edma_resource_t I2C0_EdmaResource = {RTE_I2C0_Master_DMA_BASE, RTE_I2C0_Master_DMA_CH,
                                               RTE_I2C0_Master_DMAMUX_BASE, RTE_I2C0_Master_PERI_SEL};

i2c_master_edma_handle_t I2C0_EdmaHandle;
edma_handle_t I2C0_EdmaTxRxHandle;

#if defined(__CC_ARM)
ARMCC_SECTION("i2c0_edma_driver_state")
cmsis_i2c_edma_driver_state_t I2C0_EdmaDriverState = {
#else
cmsis_i2c_edma_driver_state_t I2C0_EdmaDriverState = {
#endif
    &I2C0_Resource, &I2C0_EdmaResource, &I2C0_EdmaHandle, &I2C0_EdmaTxRxHandle,
};

static int32_t I2C0_Master_EdmaInitialize(ARM_I2C_SignalEvent_t cb_event)
{
    I2C0_InitPins();
    return I2C_Master_EdmaInitialize(cb_event, &I2C0_EdmaDriverState);
}
int32_t I2C0_Master_EdmaUninitialize(void)
{
    I2C0_DeinitPins();
    return I2C_Master_EdmaUninitialize(&I2C0_EdmaDriverState);
}
int32_t I2C0_Master_EdmaPowerControl(ARM_POWER_STATE state)
{
    return I2C_Master_EdmaPowerControl(state, &I2C0_EdmaDriverState);
}
int32_t I2C0_Master_EdmaTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_EdmaTransmit(addr, data, num, xfer_pending, &I2C0_EdmaDriverState);
}
int32_t I2C0_Master_EdmaReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_EdmaReceive(addr, data, num, xfer_pending, &I2C0_EdmaDriverState);
}
int32_t I2C0_Master_EdmaGetDataCount(void)
{
    return I2C_Master_EdmaGetDataCount(&I2C0_EdmaDriverState);
}
int32_t I2C0_Master_EdmaControl(uint32_t control, uint32_t arg)
{
    return I2C_Master_EdmaControl(control, arg, &I2C0_EdmaDriverState);
}
ARM_I2C_STATUS I2C0_Master_EdmaGetStatus(void)
{
    return I2C_Master_EdmaGetStatus(&I2C0_EdmaDriverState);
}

ARM_DRIVER_I2C I2C0_Master_Edma_Driver = {I2Cx_GetVersion,
                                          I2Cx_GetCapabilities,
                                          I2C0_Master_EdmaInitialize,
                                          I2C0_Master_EdmaUninitialize,
                                          I2C0_Master_EdmaPowerControl,
                                          I2C0_Master_EdmaTransmit,
                                          I2C0_Master_EdmaReceive,
                                          NULL,
                                          NULL,
                                          I2C0_Master_EdmaGetDataCount,
                                          I2C0_Master_EdmaControl,
                                          I2C0_Master_EdmaGetStatus};
#endif

#endif

#if defined(I2C1)

extern uint32_t I2C1_GetFreq(void);
extern void I2C1_InitPins(void);
extern void I2C1_DeinitPins(void);

